zlun10/example_code/chip/cw32l011/StdDriver/src/cw32l011_sysctrl.c
/**
 * @file cw32l011_sysctrl.c
 * @author WHXY
 * @brief
 * @version 0.1
 * @date 2022-7-12
 *
 * @copyright Copyright (c) 2021
 *
 */
 /*******************************************************************************
 *
 * 代码许可和免责信息
 * 武汉芯源半导体有限公司授予您使用所有编程代码示例的非专属的版权许可，您可以由此
 * 生成根据您的特定需要而定制的相似功能。根据不能被排除的任何法定保证，武汉芯源半
 * 导体有限公司及其程序开发商和供应商对程序或技术支持（如果有）不提供任何明示或暗
 * 含的保证或条件，包括但不限于暗含的有关适销性、适用于某种特定用途和非侵权的保证
 * 或条件。
 * 无论何种情形，武汉芯源半导体有限公司及其程序开发商或供应商均不对下列各项负责，
 * 即使被告知其发生的可能性时，也是如此：数据的丢失或损坏；直接的、特别的、附带的
 * 或间接的损害，或任何后果性经济损害；或利润、业务、收入、商誉或预期可节省金额的
 * 损失。
 * 某些司法辖区不允许对直接的、附带的或后果性的损害有任何的排除或限制，因此某些或
 * 全部上述排除或限制可能并不适用于您。
 *
 *******************************************************************************/

 /* Includes ------------------------------------------------------------------*/
#include "cw32l011_sysctrl.h"

/* Private_TypesDefinitions --------------------------------------------------*/


/* Private_Defines -----------------------------------------------------------*/

/* Private_Variables ---------------------------------------------------------*/

const uint32_t hsiprs_tbl[] = { 32, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 12, 16, 20, 24, 28 };
/* Private_FunctionPrototypes ------------------------------------------------*/

/* Private_Functions ---------------------------------------------------------*/

/* Public_Functions ----------------------------------------------------------*/

/**
 * @brief 配置SysClk 到 HCLK的分频系数
 *
 * @param HCLKPRS ：SYSCTRL_HCLK_DIV1/2/4/8/16/32/64/128
 */
void SYSCTRL_HCLKPRS_Config(uint32_t HCLKPRS)
{
    assert_param(IS_SYSCTRL_HCLKPRS(HCLKPRS));
    CW_SYSCTRL->CR0 = ((CW_SYSCTRL->CR0 & (~(SYSCTRL_KEY_MASK | SYSCTRL_CR0_HCLKPRS_Msk))) | SYSCTRL_KEY | HCLKPRS);
}
/**
 * @brief 配置HCLK 到 PCLK的分频系数
 *
 * @param PCLKPRS ：SYSCTRL_PCLK_DIV1/2/4/8
 */
void SYSCTRL_PCLKPRS_Config(uint32_t PCLKPRS)
{
    assert_param(IS_SYSCTRL_HCLKPRS(PCLKPRS));
    CW_SYSCTRL->CR0 = ((CW_SYSCTRL->CR0 & (~(SYSCTRL_KEY_MASK | SYSCTRL_CR0_PCLKPRS_Msk))) | SYSCTRL_KEY | PCLKPRS);
}

/**
 * @brief 配置SysClk的时钟源
 *
 * @param SYSCLKSRC ：SYSCTRL_SYSCLKSRC_HSI SYSCTRL_SYSCLKSRC_HSE
 *                    SYSCTRL_SYSCLKSRC_LSI SYSCTRL_SYSCLKSRC_LSE
 */
void SYSCTRL_SYSCLKSRC_Config(uint32_t SYSCLKSRC)
{
    assert_param(IS_SYSCTRL_SYSCLKSRC(SYSCLKSRC));
    CW_SYSCTRL->CR0 = ((CW_SYSCTRL->CR0 & (~(SYSCTRL_KEY_MASK | SYSCTRL_CR0_SYSCLK_Msk))) | SYSCTRL_KEY | SYSCLKSRC);
    SYSCTRL_SystemCoreClockUpdate(SYSCTRL_GetHClkFreq());
}

/**
 * @brief 配置CLKCCS  LSECCS 功能
 *
 * @param CCS  ：SYSCTRL_LSECCSEN  SYSCTRL_CLKCCSEN SYSCTRL_HSECCSEN
 * @param NewState  :ENABLE  DISABLE
 */
void SYSCTRL_CCS_Config(uint32_t CCS, FunctionalState NewState)
{
    assert_param(IS_SYSCTRL_CCS_STATUS(CCS));

    if(NewState != DISABLE)
    {
        CW_SYSCTRL->CR1 = (((CW_SYSCTRL->CR1 & (~SYSCTRL_KEY_MASK)) | SYSCTRL_KEY) | CCS);
    } else
    {
        CW_SYSCTRL->CR1 = (((CW_SYSCTRL->CR1 & (~SYSCTRL_KEY_MASK)) | SYSCTRL_KEY) & (~CCS));
    }
}

/**
 * @brief 配置LSELOCK功能：使能后软件无法关闭LSE时钟
 *
 * @param LSELOCK ： SYSCTRL_LSELOCKEN  SYSCTRL_LSELOCKDIS
 */
void SYSCTRL_LSELOCK_Config(uint32_t LSELOCK)
{
    assert_param(IS_SYSCTRL_LSELOCK_STATUS(LSELOCK));
    CW_SYSCTRL->CR1 = ((CW_SYSCTRL->CR1 & (~SYSCTRL_KEY_MASK)) | SYSCTRL_KEY | LSELOCK);
}

/**
 * @brief 配置WAKEUPCLK功能:决定从深度休眠模式唤醒后所使用的系统时钟源
 *
 * @param WAKEUPCLK ：SYSCTRL_WAKEUPCLKEN   SYSCTRL_WAKEUPCLKDIS
 */
void SYSCTRL_WAKEUPCLK_Config(uint32_t WAKEUPCLK)
{
    assert_param(IS_SYSCTRL_WAKEUPCLK_STATUS(WAKEUPCLK));
    CW_SYSCTRL->CR2 = ((CW_SYSCTRL->CR2 & (~(SYSCTRL_KEY_MASK | SYSCTRL_CR2_WAKEUPCLK_Msk))) | SYSCTRL_KEY | WAKEUPCLK);
}

/**
 * @brief 配置LOCK功能：决定异常故障后是否产生LOCKUP复位
 *
 * @param LOCKUP ：SYSCTRL_LOCKUPEN  SYSCTRL_LOCKUPDIS
 */
void SYSCTRL_LOCKUP_Config(uint32_t LOCKUP)
{
    assert_param(IS_SYSCTRL_LOCKUP_STATUS(LOCKUP));
    CW_SYSCTRL->CR2 = ((CW_SYSCTRL->CR2 & (~(SYSCTRL_KEY_MASK | SYSCTRL_CR2_LOCKUP_Msk))) | SYSCTRL_KEY | LOCKUP);
}

/**
 * @brief 配置端口SWDIO功能
 *
 * @param SWDIO  ：SYSCTRL_SWDIOEN   SYSCTRL_SWDIODIS
 */
void SYSCTRL_SWDIO_Config(uint32_t SWDIO)
{
    assert_param(IS_SYSCTRL_SWDIO_STATUS(SWDIO));
    CW_SYSCTRL->CR2 = ((CW_SYSCTRL->CR2 & (~(SYSCTRL_KEY_MASK | SYSCTRL_CR2_SWDIO_Msk))) | SYSCTRL_KEY | SWDIO);
}

/**
  * @brief  Resets the SYSCTRL clock configuration to the default reset state.
  * @param  None
  * @retval 0:success, 1:fault
  * CAUTION:
  * 1、LSEEN Bit Not Changed ,so it will not affect RTC,BUT LSELOCK BIT Changed.
  * 2、Before CALL this funciton,we should set FLASH_CR2.WAT
  */
int SYSCTRL_DeInit(void)
{
    uint16_t timeout = 0xffff;
    /* HSIEN Enable*/
    CW_SYSCTRL->CR1 = ((CW_SYSCTRL->CR1 & (~SYSCTRL_KEY_MASK)) | SYSCTRL_KEY | SYSCTRL_HSIEN);

    //Here need wait HSI STBALE
    while(((CW_SYSCTRL->HSI & SYSCTRL_HSI_STABLE_Msk) == 0) && timeout)
    {
        timeout--;
    }        //Wait stable

    if(timeout == 0) return 1;

    /* SWITCH TO HSI*/
    CW_SYSCTRL->CR0 = ((CW_SYSCTRL->CR0 & (~SYSCTRL_KEY_MASK)) | SYSCTRL_KEY | SYSCTRL_SYSCLKSRC_HSI);

    /* HCLKPRS SET TO 000,PCLKPRS SET TO 00*/
    CW_SYSCTRL->CR0 = ((CW_SYSCTRL->CR0 & (~SYSCTRL_KEY_MASK)) | SYSCTRL_KEY | SYSCTRL_HCLK_DIV1 | \
        SYSCTRL_PCLK_DIV1 | SYSCTRL_SYSCLKSRC_HSI);

    /* CLKCCS/LSECCS/LSELOCK/LSIEN/HEXEN Disable   CLKCCS / LSEEN NO CHANGE*/
    CW_SYSCTRL->CR1 = (((CW_SYSCTRL->CR1 & (~SYSCTRL_KEY_MASK)) | SYSCTRL_KEY | SYSCTRL_HSIEN) \
        & (~SYSCTRL_CLKCCSEN) & (~SYSCTRL_LSECCSEN) \
        & (~SYSCTRL_LSELOCKEN) & (~SYSCTRL_LSIEN) & (~SYSCTRL_HSEEN));

    /* SWDIO Enable,LOCKUP/WAKEUPCLK Disable*/
    CW_SYSCTRL->CR2 = (((((CW_SYSCTRL->CR2 & (~SYSCTRL_KEY_MASK)) | SYSCTRL_KEY) \
        & (~SYSCTRL_SWDIOEN)) & (~SYSCTRL_LOCKUPEN)) & (~SYSCTRL_WAKEUPCLKEN));

    /* Disable all interrupts */
    CW_SYSCTRL->IER = 0x5A5AFE00;      //IER have KEY attribute

    /* Clear all pending bits  */
    CW_SYSCTRL->ICR &= 0xFFFFFE00;

    return 0;

}

/**
 * @brief
 *
 * @param NewFreq
 */
void SYSCTRL_SystemCoreClockUpdate(uint32_t NewFreq)
{
    SystemCoreClock = NewFreq;
}

/**
 * @brief 获得系统时钟（HCLK）频率值
 *
 * @return uint32_t   HCLK频率值(Hz)
 */
uint32_t SYSCTRL_GetHClkFreq(void)
{
    uint32_t u32rtnVal = 0;
    uint32_t sysclksource = 0;
    uint32_t hsiprs = 0;

    sysclksource = CW_SYSCTRL->CR0_f.SYSCLK;
    hsiprs = CW_SYSCTRL->HSI_f.DIV;

    switch(sysclksource)
    {
    case 0x00:  /* HSI used as system clock */
        u32rtnVal = (HSIOSC_VALUE / hsiprs_tbl[hsiprs]);
        break;

    case 0x01:  /* HSE used as system clock */
        u32rtnVal = HSE_VALUE;
        break;

    case 0x03:  /* LSI used as system clock */
        u32rtnVal = LSI_VALUE;
        break;

    case 0x04:  /* LSE used as system clock */
        u32rtnVal = LSE_VALUE;
        break;

    default:
        u32rtnVal = (HSIOSC_VALUE / hsiprs_tbl[hsiprs]);
        break;
    }

    u32rtnVal = (u32rtnVal >> CW_SYSCTRL->CR0_f.HCLKPRS);
    return u32rtnVal;
}

/**
 * @brief 获得外设时钟（PCLK）频率值
 *
 * @return uint32_t    PCLK频率值(Hz)
 */
uint32_t SYSCTRL_GetPClkFreq(void)
{
    uint32_t u32Val = 0;

