zlun10/example_code/chip/cw32l011/StdDriver/src/cw32l011_sysctrl.c
    //LSE使能,同时使能CLKCCS和LSECCS，使能时钟失效切换
    CW_SYSCTRL->CR1 |= SYSCTRL_KEY | SYSCTRL_CLKCCSEN | SYSCTRL_CR1_LSECCS_Msk | SYSCTRL_CR1_LSEEN_Msk;                    //Enable LSE

    //等待LSE稳定
    while((CW_SYSCTRL->LSE_f.STABLE == 0) && timeout)
    {
        timeout--;
    }//Wait stable

    if(timeout == 0) return 1;

    return 0;
}

/**
* @brief  Disable LSE
* @param  None
* @retval None
*/
void SYSCTRL_LSE_Disable(void)
{
    CW_SYSCTRL->CR1 = (((CW_SYSCTRL->CR1 & (~SYSCTRL_KEY_MASK)) | SYSCTRL_KEY) & \
        (~SYSCTRL_CR1_LSEEN_Msk));
}

/**
* @brief  CLKSRC switch
* @param  NewClk:
*                SYSCTRL_SYSCLKSRC_HSI,
*                SYSCTRL_SYSCLKSRC_HSE,
*                SYSCTRL_SYSCLKSRC_LSI,
*                SYSCTRL_SYSCLKSRC_LSE
* @retval 0: PASS, 1: Fail
*
* NOTE:调用此函数之前需要保证新时钟源已经使能（ENABLE函数中已包含等待时钟稳定过程）。
*/

int SYSCTRL_SysClk_Switch(uint32_t NewClk)
{
    assert_param(IS_SYSCTRL_SYSCLKSRC(NewClk));

    switch(NewClk)
    {
    default:
    case SYSCTRL_SYSCLKSRC_HSI:
        if((CW_SYSCTRL->ISR_f.HSIRDY == 0) || (CW_SYSCTRL->ISR_f.HSISTABLE == 0))
            return 1;

        break;

    case SYSCTRL_SYSCLKSRC_HSE:
        if(CW_SYSCTRL->ISR_f.HSESTABLE == 0)
            return 1;

        break;

    case SYSCTRL_SYSCLKSRC_LSI:
        if((CW_SYSCTRL->ISR_f.LSIRDY == 0) || (CW_SYSCTRL->ISR_f.LSISTABLE == 0))
            return 1;

        break;

    case SYSCTRL_SYSCLKSRC_LSE:
        if((CW_SYSCTRL->ISR_f.LSEFAIL == 1) || (CW_SYSCTRL->ISR_f.LSERDY == 0) || \
            (CW_SYSCTRL->ISR_f.LSESTABLE == 0) || (CW_SYSCTRL->ISR_f.LSEFAIL == 1))
            return 1;

        break;
    }

    CW_SYSCTRL->CR0 = ((((CW_SYSCTRL->CR0 & (~SYSCTRL_KEY_MASK)) | SYSCTRL_KEY) & (~SYSCTRL_CR0_SYSCLK_Msk)) | (NewClk));

    SYSCTRL_SystemCoreClockUpdate(SYSCTRL_GetHClkFreq());

    return (((CW_SYSCTRL->CR0 & SYSCTRL_CR0_SYSCLK_Msk) == NewClk) ? 0U : 1U);
}

/**
 * @brief SYSCTRL中断配置
 *
 * @param SYSCTRL_IT ：SYSCTRL_IT_LSEFAULT SYSCTRL_IT_LSEFAIL
 *                 SYSCTRL_IT_LSERDY     SYSCTRL_IT_LSIRDY
 *                 SYSCTRL_IT_HSIRDY
 * @param NewState  :ENABLE  DISABLE
 */
void SYSCTRL_ITConfig(uint32_t SYSCTRL_IT, FunctionalState NewState)
{
    assert_param(IS_SYSCTRL_IT(SYSCTRL_IT));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if(NewState != DISABLE)     //IER have KEY attribute
    {
        CW_SYSCTRL->IER = ((CW_SYSCTRL->IER & (~SYSCTRL_KEY_MASK)) | SYSCTRL_KEY) | SYSCTRL_IT;
    } else                         //IER have KEY attribute
    {
        CW_SYSCTRL->IER = ((CW_SYSCTRL->IER & (~SYSCTRL_KEY_MASK)) | SYSCTRL_KEY) & (~SYSCTRL_IT);
    }
}

/**
 * @brief 获取SYSCTRL指定中断状态
 *
 * @param SYSCTRL_IT ： SYSCTRL_IT_LSEFAULT    SYSCTRL_IT_LSEFAIL
 *                 SYSCTRL_IT_LSERDY     SYSCTRL_IT_LSIRDY
 *                 SYSCTRL_IT_HSIRDY
 *
 * @return ITStatus  : SET   RESET
 */
ITStatus SYSCTRL_GetITStatus(uint32_t SYSCTRL_IT)
{
    assert_param(IS_SYSCTRL_GET_IT(SYSCTRL_IT));

    return (CW_SYSCTRL->ISR & SYSCTRL_IT) ? SET : RESET;
}


/**
 * @brief 清除SYSCTRL指定中断标志
 *
 * @param SYSCTRL_IT ：SYSCTRL_IT_LSEFAULT     SYSCTRL_IT_LSEFAIL
 *                 SYSCTRL_IT_LSERDY     SYSCTRL_IT_LSIRDY
 *                 SYSCTRL_IT_HSIRDY
 *
 */
void SYSCTRL_ClearITPendingBit(uint32_t SYSCTRL_IT)
{
    assert_param(IS_SYSCTRL_GET_IT(SYSCTRL_IT));

    CW_SYSCTRL->ICR &= (~SYSCTRL_IT);
}

/**
 * @brief 获取指定时钟源稳定标志
 *
 * @param SYSCTRL_STABLEFLAG ：SYSCTRL_FLAG_HSISTABLE  SYSCTRL_FLAG_HEXSTABLE
 *                         SYSCTRL_FLAG_LSESTABLE
 *                         SYSCTRL_FLAG_LSISTABLE
 * @return FlagStatus ：SET   RESET
 */
FlagStatus SYSCTRL_GetStableFlag(uint32_t SYSCTRL_STABLEFLAG)
{
    assert_param(IS_SYSCTRL_STABLEFLAG(SYSCTRL_STABLEFLAG));

    return(((CW_SYSCTRL->ISR) & SYSCTRL_STABLEFLAG) ? SET : RESET);
}

/**
 * @brief  获取所有时钟源稳定标志
 *
 * @return uint32_t ：返回ISR寄存器内容
 */
uint32_t SYSCTRL_GetAllStableFlag(void)
{
    return(CW_SYSCTRL->ISR);
}


/**
 * @brief AHB外设时钟设置
 *
 * @param Periph  ：SYSCTRL_AHB_PERIPH_GPIOA   SYSCTRL_AHB_PERIPH_GPIOB
 *                  SYSCTRL_AHB_PERIPH_CRC     SYSCTRL_AHB_PERIPH_FLASH
 * @param NewState  ENABLE  DISABLE
 */
void SYSCTRL_AHBPeriphClk_Enable(uint32_t Periph, FunctionalState NewState)
{
    assert_param(IS_SYSCTRL_AHB_PERIPH(Periph));

    if(NewState != DISABLE)
    {
        CW_SYSCTRL->AHBEN |= SYSCTRL_KEY | Periph;
    } else
    {
        CW_SYSCTRL->AHBEN = SYSCTRL_KEY | (CW_SYSCTRL->AHBEN & (~Periph));
    }
}

/**
 * @brief APB外设时钟设置1
 *
 * @param Periph   ：  SYSCTRL_APB1_PERIPH_ATIM    SYSCTRL_APB1_PERIPH_GTIM1
 *                     SYSCTRL_APB1_PERIPH_GTIM2   SYSCTRL_APB1_PERIPH_UART3
 *                     SYSCTRL_APB1_PERIPH_UART2   SYSCTRL_APB1_PERIPH_UART1
 *                     SYSCTRL_APB1_PERIPH_SPI1    SYSCTRL_APB1_PERIPH_VC
 *                     SYSCTRL_APB1_PERIPH_ADC
 * @param NewState  ENABLE  DISABLE
 */
void SYSCTRL_APBPeriphClk_Enable1(uint32_t Periph, FunctionalState NewState)
{
    assert_param(IS_SYSCTRL_APB1_PERIPH(Periph));

    if(NewState != DISABLE)
    {
        CW_SYSCTRL->APBEN1 |= SYSCTRL_KEY | Periph;
    } else
    {
        CW_SYSCTRL->APBEN1 = SYSCTRL_KEY | (CW_SYSCTRL->APBEN1 & (~Periph));
    }
}

/**
 * @brief APB外设时钟设置2
 *
 * @param Periph ：  SYSCTRL_APB2_PERIPH_I2C       SYSCTRL_APB2_PERIPH_LPTIM
 *                   SYSCTRL_APB2_PERIPH_IWDT      SYSCTRL_APB2_PERIPH_RTC
 *                   SYSCTRL_APB2_PERIPH_BTIM123
 * @param NewState :  ENABLE  DISABLE
 */
void SYSCTRL_APBPeriphClk_Enable2(uint32_t Periph, FunctionalState NewState)
{
    assert_param(IS_SYSCTRL_APB2_PERIPH(Periph));

    if(NewState != DISABLE)
    {
        CW_SYSCTRL->APBEN2 |= SYSCTRL_KEY | Periph;
    } else
    {
        CW_SYSCTRL->APBEN2 = SYSCTRL_KEY | (CW_SYSCTRL->APBEN2 & (~Periph));
    }
}

/**
 * @brief 外设配置时钟使能
 *
 * @param Periph  ：见SYSCTRL_PeriphEnumTypeDef定义
 * @param _bool   : TRUE   FALSE
 */

void SYSCTRL_PeripheralsClkEnalbe(SYSCTRL_PeriphEnumTypeDef Periph, boolean_t _bool)
{
    if(_bool == TRUE)
    {
        if(Periph & 0x000000FF)
        {
            CW_SYSCTRL->AHBEN |= SYSCTRL_KEY | (Periph & 0x000000FF);
        }
        if(Periph & 0x0000FF00)
        {
            CW_SYSCTRL->APBEN1 |= SYSCTRL_KEY | ((Periph & 0x0000FF00) >> 8);
        }
        if(Periph & 0x00FF0000)
        {
            CW_SYSCTRL->APBEN2 |= SYSCTRL_KEY | ((Periph & 0x00FF0000) >> 8);
        }
    } else
    {
        if(Periph & 0x000000FF)
        {
            CW_SYSCTRL->AHBEN &= SYSCTRL_KEY | ~(Periph & 0x000000FF);
        }
        if(Periph & 0x0000FF00)
        {
            CW_SYSCTRL->APBEN1 &= SYSCTRL_KEY | ~((Periph & 0x0000FF00) >> 8);
        }
        if(Periph & 0x00FF0000)
        {
            CW_SYSCTRL->APBEN2 &= SYSCTRL_KEY | ~((Periph & 0x00FF0000) >> 8);
        }
    }
}
/**
 * @brief AHB外设复位设置
 *
 * @param Periph  ：SYSCTRL_AHB_PERIPH_GPIOA   SYSCTRL_AHB_PERIPH_GPIOB
 *                  SYSCTRL_AHB_PERIPH_CRC     SYSCTRL_AHB_PERIPH_FLASH
 * @param NewState  : ENABLE  DISABLE
 */
void SYSCTRL_AHBPeriphReset(uint32_t Periph, FunctionalState NewState)
{
    assert_param(IS_SYSCTRL_AHB_PERIPH(Periph));

