zlun10/example_code/chip/cw32l011/StdDriver/src/cw32l011_sysctrl.c
    if(NewState != ENABLE)
    {
        CW_SYSCTRL->AHBRST |= Periph;
    } else
    {
        CW_SYSCTRL->AHBRST &= (~Periph);
    }
}

/**
 * @brief APB外设复位设置1
 *
 * @param Periph   ：  SYSCTRL_APB1_PERIPH_ATIM    SYSCTRL_APB1_PERIPH_GTIM1
 *                     SYSCTRL_APB1_PERIPH_UART2   SYSCTRL_APB1_PERIPH_UART1
 *                     SYSCTRL_APB1_PERIPH_SPI1    SYSCTRL_APB1_PERIPH_VC
 *                     SYSCTRL_APB1_PERIPH_ADC
 * @param NewState  : ENABLE  DISABLE
 */
void SYSCTRL_APBPeriphReset1(uint32_t Periph, FunctionalState NewState)
{
    assert_param(IS_SYSCTRL_APB1_PERIPH(Periph));

    if(NewState != ENABLE)
    {
        CW_SYSCTRL->APBRST1 |= Periph;
    } else
    {
        CW_SYSCTRL->APBRST1 &= (~Periph);
    }
}

/**
 * @brief APB外设复位设置2
 *
 * @param Periph ：  SYSCTRL_APB2_PERIPH_I2C       SYSCTRL_APB2_PERIPH_LPTIM
 *                   SYSCTRL_APB2_PERIPH_IWDT      SYSCTRL_APB2_PERIPH_RTC
 *                   SYSCTRL_APB2_PERIPH_BTIM123
 * @param NewState : ENABLE  DISABLE
 */
void SYSCTRL_APBPeriphReset2(uint32_t Periph, FunctionalState NewState)
{
    assert_param(IS_SYSCTRL_APB1_PERIPH(Periph));

    if(NewState != ENABLE)
    {
        CW_SYSCTRL->APBRST2 |= Periph;
    } else
    {
        CW_SYSCTRL->APBRST2 &= (~Periph);
    }
}

/**
 * @brief 外设复位使能
 *
 * @param Periph  ：见SYSCTRL_PeriphEnumTypeDef定义
 * @param _bool   : TRUE   FALSE
 */

void SYSCTRL_PeripheralsResetEnalbe(SYSCTRL_PeriphEnumTypeDef Periph, boolean_t _bool)
{
    if(_bool == FALSE)
    {
        if(Periph & 0x000000FF)
        {
            CW_SYSCTRL->AHBRST |= (Periph & 0x000000FF);
        }
        if(Periph & 0x0000FF00)
        {
            CW_SYSCTRL->APBRST1 |= ((Periph & 0x0000FF00) >> 8);
        }
        if(Periph & 0x00FF0000)
        {
            CW_SYSCTRL->APBRST2 |= ((Periph & 0x00FF0000) >> 8);
        }
    } else
    {
        if(Periph & 0x000000FF)
        {
            CW_SYSCTRL->AHBRST &= ~(Periph & 0x000000FF);
        }
        if(Periph & 0x0000FF00)
        {
            CW_SYSCTRL->APBRST1 &= ~((Periph & 0x0000FF00) >> 8);
        }
        if(Periph & 0x00FF0000)
        {
            CW_SYSCTRL->APBRST2 &= ~((Periph & 0x00FF0000) >> 8);
        }
    }
}

/**
 * @brief 获取指定的系统复位标志
 *
 * @param SYSCTRL_RSTFLAG  ：SYSCTRL_FLAG_PORRST   SYSCTRL_FLAG_SYSRESETREQRST
 *                           SYSCTRL_FLAG_LVDRST   SYSCTRL_FLAG_LOCKUPRST
 *                           SYSCTRL_FLAG_IWDTRST  SYSCTRL_FLAG_RSTBRST
 * @return FlagStatus  SET RESET
 */
FlagStatus SYSCTRL_GetRstFlag(uint32_t SYSCTRL_RSTFLAG)
{
    assert_param(IS_SYSCTRL_RSTFLAG(SYSCTRL_RSTFLAG));

    return(((CW_SYSCTRL->RESETFLAG) & SYSCTRL_RSTFLAG) ? SET : RESET);
}

/**
 * @brief 获取复位标志寄存器内容
 *
 * @return uint32_t
 */
uint32_t SYSCTRL_GetAllRstFlag(void)
{
    return(CW_SYSCTRL->RESETFLAG);
}

/**
 * @brief 清除指定或者全部复位标志
 *
 * @param SYSCTRL_RSTFLAG  ：SYSCTRL_FLAG_PORRST   SYSCTRL_FLAG_SYSRESETREQRST
 *                           SYSCTRL_FLAG_LVDRST   SYSCTRL_FLAG_LOCKUPRST
 *                           SYSCTRL_FLAG_IWDTRST  SYSCTRL_FLAG_RSTBRST
 * @return
 */
void SYSCTRL_ClearRstFlag(uint32_t SYSCTRL_RSTFLAG)
{
    assert_param(IS_SYSCTRL_RSTFLAG(SYSCTRL_RSTFLAG));
    CW_SYSCTRL->RESETFLAG &= (~SYSCTRL_RSTFLAG);
}

/**
 * @brief 配置PCLK_OUT引脚(PA03)输出PCLK时钟
 *
 */
void SYSCTRL_PCLK_OUT(void)
{
    __SYSCTRL_GPIOA_CLK_ENABLE();
    CW_GPIOA->ANALOG_f.PIN3 = 0U;
    CW_GPIOA->DIR_f.PIN3 = 0U;
    CW_GPIOA->AFRL_f.AFR3 = 4U;
}

/**
 * @brief  配置MCO_OUT引脚(PA04)输出指定的时钟源及分频比
 *
 * @param Source  ：SYSCTRL_MCO_SRC_NONE    SYSCTRL_MCO_SRC_HCLK
 *                  SYSCTRL_MCO_SRC_PCLK    SYSCTRL_MCO_SRC_HSI
 *                  SYSCTRL_MCO_SRC_LSI     SYSCTRL_MCO_SRC_HSE
 *                  SYSCTRL_MCO_SRC_LSE
 *
 * @param Div     ：SYSCTRL_MCO_DIV1/2/8/64/128/256/512/1024
 */
void SYSCTRL_MCO_OUT(uint8_t Source, uint8_t Div)
{
    assert_param(IS_SYSCTRL_MCO_SRC(Source));
    assert_param(IS_SYSCTRL_MCO_DIV(Div));

    CW_SYSCTRL->AHBEN |= SYSCTRL_KEY | SYSCTRL_AHBEN_GPIOA_Msk; //Open GPIOA clk

    CW_GPIOA->ANALOG &= ~GPIOx_ANALOG_PIN4_Msk;  //Digit
    CW_GPIOA->AFRL = ((CW_GPIOA->AFRL) & (~(uint32_t) (GPIOx_AFRL_AFR4_Msk))) | (uint32_t) (0x4U << GPIOx_AFRL_AFR4_Pos);
    CW_GPIOA->DIR &= ~GPIOx_DIR_PIN4_Msk;     //Output

    CW_SYSCTRL->MCO = (uint32_t) (Source | Div);
}

void SYSCTRL_GotoSleep(void)
{
    SCB->SCR &= ~(SCB_SCR_SLEEPDEEP_Msk);
    SCB->SCR |= SCB_SCR_SEVONPEND_Msk;
    __DSB();
    __WFE();
}

void SYSCTRL_GotoDeepSleep(void)
{
    SCB->SCR |= SCB_SCR_SLEEPDEEP_Msk;
    __DSB();
    __WFI();
}

void SYSCTRL_ConfigSleepOnExit(FunctionalState state)
{
    if(state == ENABLE)
    {
        SCB->SCR |= SCB_SCR_SLEEPONEXIT_Msk;
    } else
    {
        SCB->SCR &= ~SCB_SCR_SLEEPONEXIT_Msk;
    }
}

void SYSCTRL_ClearResetFlags(void)
{
    CW_SYSCTRL->RESETFLAG = 0x0000;    // 写0清除所有复位标志
}
